# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [3.5,5, 4.5,10, 8.5,7]  # P3/8
  - [8.5,15.5, 18,10, 16.5,21]  # P4/16
  - [35.5,19, 25,38.5, 62,47]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 1, E_ELAN, [256,0.5]],  # 4

   [-1, 1, MPConv, [0.5]],
   [-1, 1, E_ELAN, [512, 0.5]],  # 6

   [-1, 1, MPConv, [0.5]],
   [-1, 1, E_ELAN, [1024,0.5]],  # 8

   [-1, 1, MPConv, [0.5]],
   [-1, 1, E_ELAN, [1024,0.25]],  # 10
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 11 54
  
   [-1, 1, Conv, [256, 1, 1]],#12
   [[-1, 8,6], 1, SF, [512,256]],  #13 # cat backbone P4
   [-1, 1, E_ELAN_H, [256,0.5,0.25]], #14

   
   [-1, 1, Conv, [128, 1, 1]], #15
   [[-1, 6,4], 1, SF, [256,128]], #16
   [-1, 1, E_ELAN_H, [128,0.5,0.25]], #17
      
   [-1, 1, MPConv, [1]], # 18
   [[-1, 14], 1, Concat, [1]], # 19
   [-1, 1, E_ELAN_H, [256,0.5,0.25]], # 20
      
   [-1, 1, MPConv, [1]], # 21
   [[-1, 11], 1, Concat, [1]], # 22
   [-1, 1, E_ELAN_H, [512,0.5,0.25]], #23
   
   [17, 1, RepConv, [256, 3, 1]],
   [20, 1, RepConv, [512, 3, 1]],
   [23, 1, RepConv, [1024, 3, 1]],

   [[24,25,26], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
