# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2      
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 1, E_ELAN, [256,0.5]],  # 4

   [-1, 1, MPConv, [0.5]],
   [-1, 1, E_ELAN, [512, 0.5]],  # 6

   [-1, 1, MPConv, [0.5]],
   [-1, 1, E_ELAN, [1024,0.5]],  # 8

   [-1, 1, MPConv, [0.5]],
   [-1, 1, E_ELAN, [1024,0.25]],  # 10
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 11 54

   [-1, 1, Conv, [256, 1, 1]],#12
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [8, 1, Conv, [256, 1, 1]], # 14 route backbone P4
   [[-1, -2], 1, Concat, [1]], # 15
   [-1, 1, E_ELAN_H, [256,0.5,0.25]], #16


   [-1, 1, Conv, [128, 1, 1]], #17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #18
   [6, 1, Conv, [128, 1, 1]], # route backbone P3 19
   [[-1, -2], 1, Concat, [1]], # 20
   [-1, 1, E_ELAN_H, [128,0.5,0.25]], #21

   [-1, 1, MPConv, [1]], # 22
   [[-1, 16], 1, Concat, [1]],# 23
   [-1, 1, E_ELAN_H, [256,0.5,0.25]], # 24

   [-1, 1, MPConv, [1]], # 25
   [[-1, 12], 1, Concat, [1]], # 26
   [-1, 1, E_ELAN_H, [512,0.5,0.25]], #27

   [ 21, 1, space_to_depth, [1] ],
   [ 24, 1, space_to_depth, [1] ],
   [ 27, 1, space_to_depth, [1] ],

   [28, 1, RepConv, [256, 3, 1]],
   [29, 1, RepConv, [512, 3, 1]],
   [30, 1, RepConv, [1024, 3, 1]],

   [[31,32,33], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
